conf/server/perfSONAR-LSQuery.xml

<?xml version='1.0' encoding='UTF-8'?>
<SOAP-ENV:Envelope xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <nmwg:message type="LSQueryRequest" id="msg1" xmlns:nmwg="http://ggf.org/ns/nmwg/base/2.0/" xmlns:xquery="http://ggf.org/ns/nmwg/tools/org/perfsonar/service/lookup/xquery/1.0/">
            <nmwg:metadata id="meta2">
                <xquery:subject id="sub2">
                    declare namespace nmwg="http://ggf.org/ns/nmwg/base/2.0/";
                    declare namespace nmtb="http://ogf.org/schema/network/topology/base/20070828/";
                    /nmwg:store[@type="LSStore"]/nmwg:data/nmtb:node/nmtb:relation/nmtb:linkIdRef/text()[../../../nmtb:address[text()="<!--hostname-->"]]
                </xquery:subject>
                <nmwg:eventType>http://ggf.org/ns/nmwg/tools/org/perfsonar/service/lookup/xquery/1.0</nmwg:eventType>
                <xquery:parameters id="param.1">
                <nmwg:parameter name="lsOutput">native</nmwg:parameter>
                 </xquery:parameters>
            </nmwg:metadata>
            <nmwg:data metadataIdRef="meta2" id="d2"/>
        </nmwg:message>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>